import React, { PureComponent } from 'react';
import {
    BarChart, Bar, Cell, XAxis, YAxis, CartesianGrid, Tooltip, Legend
} from 'recharts';

const data = [
    {
        name: "2550", สำนักปลัดกระทรวงการท่องเที่ยวและกีฬา: 399.2097, กรมพลศึกษา: 654.4969, กรมการท่องเที่ยว: 663.0308, สถาบันการพลศึกษา: 1683.2626
    },
    {
        name: "2551", สำนักปลัดกระทรวงการท่องเที่ยวและกีฬา: 437.4953, กรมพลศึกษา: 699.2109, กรมการท่องเที่ยว: 688.2617, สถาบันการพลศึกษา: 1820.0321
    },
    {
        name: "2552", สำนักปลัดกระทรวงการท่องเที่ยวและกีฬา: 818.3279, กรมพลศึกษา: 737.1717, กรมการท่องเที่ยว: 786.0635, สถาบันการพลศึกษา: 2097.6831
    },
    {
        name: "2553", สำนักปลัดกระทรวงการท่องเที่ยวและกีฬา: 608.2161, กรมพลศึกษา: 832.9235, กรมการท่องเที่ยว: 741.0726, สถาบันการพลศึกษา: 1930.929
    },
    {
        name: "2554", สำนักปลัดกระทรวงการท่องเที่ยวและกีฬา: 1546.1861, กรมพลศึกษา: 1887.5616, กรมการท่องเที่ยว: 1569.1006, สถาบันการพลศึกษา: 2014.6848
    },
    {
        name: "2555", สำนักปลัดกระทรวงการท่องเที่ยวและกีฬา: 1622.8008, กรมพลศึกษา: 3858.0925, กรมการท่องเที่ยว: 2623.8189, สถาบันการพลศึกษา: 2159.8328
    },
    {
        name: "2556", สำนักปลัดกระทรวงการท่องเที่ยวและกีฬา: 1451.9125, กรมพลศึกษา: 4166.7834, กรมการท่องเที่ยว: 3932.5666, สถาบันการพลศึกษา: 2374.704
    },
    {
        name: "2557", สำนักปลัดกระทรวงการท่องเที่ยวและกีฬา: 1272.4315, กรมพลศึกษา: 5255.0813, กรมการท่องเที่ยว: 4933.1978, สถาบันการพลศึกษา: 2346.3748
    },
    {
        name: "2558", สำนักปลัดกระทรวงการท่องเที่ยวและกีฬา: 1154.657, กรมพลศึกษา: 1612.8714, กรมการท่องเที่ยว: 2817.3736, สถาบันการพลศึกษา: 2346.9233
    },
    {
        name: "2559", สำนักปลัดกระทรวงการท่องเที่ยวและกีฬา: 1087.7355, กรมพลศึกษา: 1411.683, กรมการท่องเที่ยว: 1899.9213, สถาบันการพลศึกษา: 2737.4129
    },
    {
        name: "2560", สำนักปลัดกระทรวงการท่องเที่ยวและกีฬา: 692.141, กรมพลศึกษา: 1361.0434, กรมการท่องเที่ยว: 1236.2074, สถาบันการพลศึกษา: 2651.09
    },
    {
        name: "2561", สำนักปลัดกระทรวงการท่องเที่ยวและกีฬา: 371.8843, กรมพลศึกษา: 1343.7178, กรมการท่องเที่ยว: 249.6015, สถาบันการพลศึกษา: 1836.2297
    },
    {
        name: "2562", สำนักปลัดกระทรวงการท่องเที่ยวและกีฬา: 900.57, กรมพลศึกษา: 1134.8483, กรมการท่องเที่ยว: 1775.0818, สถาบันการพลศึกษา: 2264.4972
    },
];

export default class barchart extends PureComponent {
    render() {
        return (
            <BarChart
                width={900}
                height={400}
                data={data}
                margin={{
                    top: 20, right: 30, left: 20, bottom: 20,
                }}
            >
                <CartesianGrid strokeDasharray="3 3" />
                <XAxis dataKey="name" />
                <YAxis />
                <Tooltip />
                <Legend />
                <Bar dataKey="สำนักปลัดกระทรวงการท่องเที่ยวและกีฬา" fill="#8884d8" />
                <Bar dataKey="กรมพลศึกษา"  fill="#82ca9d" />
                <Bar dataKey="กรมการท่องเที่ยว"  fill="#ffc658" />
                <Bar dataKey="สถาบันการพลศึกษา"  fill="#aad6d8" />
            </BarChart>
        );
    }
}
